request/createOrder.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<CreateQuickSalesOrder xmlns="http://mac-its.com/Service4Mac" xmlns:ns2="urn:microsoft-dynamics-schemas/page/quicksalesorder" xmlns:ns3="urn:microsoft-dynamics-nav/xmlports/x5105058">
			<pRC>
				<Server>{{config.ip}}</Server>
				<Port>{{config.port}}</Port>
				<NavServiceName>RHO110_STG_WS</NavServiceName>
				<Company>Rhodius</Company>
				<ServiceType>Page</ServiceType>
				<AppUserKey>{{config.key}}</AppUserKey>
			</pRC>
			<pQuickSalesOrder>
				<ns2:Document_Type5295337>Order</ns2:Document_Type5295337>
				<ns2:External_Document_No>{{order.id}}</ns2:External_Document_No> <!-- Shopify Internal Order No -->
				<ns2:Order_Date>{{order.date}}</ns2:Order_Date>
				<ns2:Order_Time>{{order.time}}</ns2:Order_Time>
				<ns2:Sell_to_Country_Region_Code>DE</ns2:Sell_to_Country_Region_Code>
				<ns2:Sell_to_Cust_Salutation_Code>{{customer.gender}}</ns2:Sell_to_Cust_Salutation_Code> <!-- H = Male / F = Female -->
				<ns2:Sell_to_Customer_No>{{customer.number}}</ns2:Sell_to_Customer_No> <!-- Shopify Internal Customer No -->
				<ns2:Sell_to_Customer_Name>{{customer.name}}</ns2:Sell_to_Customer_Name>
				<ns2:Sell_to_Customer_First_Name>{{customer.firstName}}</ns2:Sell_to_Customer_First_Name>
				<ns2:Sell_to_Customer_Surname>{{customer.lastName}}</ns2:Sell_to_Customer_Surname>
				<ns2:Sell_to_Street>{{shiping.address.street}}</ns2:Sell_to_Street>
				<ns2:Sell_to_House_No>{{shiping.address.number}}</ns2:Sell_to_House_No>
				<ns2:Sell_to_House_No_Adding/>
				<ns2:Sell_to_Address_2/>
				<ns2:Sell_to_City>{{shiping.address.city}}</ns2:Sell_to_City>
				<ns2:Sell_to_Post_Code>{{shiping.address.postalCode}}</ns2:Sell_to_Post_Code>
				<ns2:Sell_to_E_Mail>{{customer.email}}</ns2:Sell_to_E_Mail> <!-- Customer E-Mail -->
				<ns2:Sell_to_Cust_Type>Person</ns2:Sell_to_Cust_Type> <!-- fix -->
				<ns2:Amount>{{payment.amount}}</ns2:Amount> <!-- Total Order Amount incl. Shipment, Deposit etc. -->
				<ns2:Shipping_Charge_Amount>{{payment.shipingAmount}}</ns2:Shipping_Charge_Amount>
				<ns2:Shipping_Charge_free>{{payment.isShipingFree}}</ns2:Shipping_Charge_free> <!-- true / false -->
				<ns2:Payment_Method_Code>{{payment.methodCode}}</ns2:Payment_Method_Code>
				<ns2:PSP_Organisation>{{payment.PSP}}</ns2:PSP_Organisation>
				<ns2:External_Reference_No>{{payment.id}}</ns2:External_Reference_No>
				<ns2:External_Transaction_No>{{payment.transactionId}}</ns2:External_Transaction_No> 
				<ns2:Ship_to_Cust_Salutation_Code>H</ns2:Ship_to_Cust_Salutation_Code>
				<ns2:Ship_to_Country_Region_Code>DE</ns2:Ship_to_Country_Region_Code>
				<ns2:Ship_to_Name>{{customer.name}}</ns2:Ship_to_Name>
				<ns2:Ship_to_Customer_First_Name>{{customer.firstName}}</ns2:Ship_to_Customer_First_Name>
				<ns2:Ship_to_Customer_Surname>{{customer.lastName}}</ns2:Ship_to_Customer_Surname>
				<ns2:Ship_to_Street>{{shiping.address.street}}</ns2:Ship_to_Street>
				<ns2:Ship_to_House_No>{{shiping.address.number}}</ns2:Ship_to_House_No>
				<ns2:Ship_to_House_No_Adding/>
				<ns2:Ship_to_Address_2/>
				<ns2:Ship_to_City>{{shipping.address.city}}</ns2:Ship_to_City>
				<ns2:Ship_to_Post_Code>{{shipping.address.postalCode}}</ns2:Ship_to_Post_Code>
				<ns2:Shipping_Agent_Code>DHL</ns2:Shipping_Agent_Code>
				<ns2:Shipping_Agent_Service_Code>{{shiping.serviceCode}}</ns2:Shipping_Agent_Service_Code> <!-- VERIFYAGE -->
				<ns2:Language_Code>DEU</ns2:Language_Code>
				<ns2:Prices_Including_VAT>true</ns2:Prices_Including_VAT> <!-- fix -->
				<ns2:Promotion_Medium_No>RHODIUS.DE</ns2:Promotion_Medium_No> <!-- fix -->
				<ns2:Promotion_Medium_Trg_Grp_No>STD</ns2:Promotion_Medium_Trg_Grp_No> <!-- fix -->
				<ns2:ShipTo_is_SellTo>true</ns2:ShipTo_is_SellTo>
				<ns2:Currency_Code>{{payment.currency}}</ns2:Currency_Code>

				<ns2:QuickSalesLines>
					{{#products}}
					<ns2:Quick_Sales_Subform_WebService>
						<ns2:Document_Type>Order</ns2:Document_Type> <!-- fix -->
						<ns2:Line_No>{{genNumber}}</ns2:Line_No> <!-- 10000 , 20000.... -->
						<ns2:LineType>Item</ns2:LineType>  <!-- fix -->
						<ns2:No>{{number}}</ns2:No> <!-- Specific Item No -->
						<ns2:Description>{{description}}</ns2:Description> <!-- Item Description used for documents, emails etc. -->
						<ns2:Variant_Code/>
						<ns2:Unit_of_Measure_Code>STK</ns2:Unit_of_Measure_Code> <!-- fix -->
						<ns2:Quantity>{{quantity}}</ns2:Quantity>
						<ns2:Unit_Price>{{price}}</ns2:Unit_Price>
						<ns2:Item_used_as>Item</ns2:Item_used_as> <!-- fix -->
						{{#discount}}
						<ns2:Line_Discount_Amount>{{discount}}</ns2:Line_Discount_Amount>
						{{/discount}}
					</ns2:Quick_Sales_Subform_WebService>
					{{/products}}
				</ns2:QuickSalesLines>
                    <ns2:DocumentValue>
                        <ns2:Quick_Sales_Sub_Doc_Val_WS>
                           	<ns2:Line_No>0</ns2:Line_No>
                           	<ns2:Entry_No>1</ns2:Entry_No>
                           	<ns2:Identifier>FREEITEM</ns2:Identifier> <!-- Fix -->
                           	<ns2:ValueText>Autograph</ns2:ValueText> <!-- Free Text -->
                        </ns2:Quick_Sales_Sub_Doc_Val_WS>
					{{#specialItems}}
					<ns2:Quick_Sales_Sub_Doc_Val_WS>
						<ns2:Line_No>{{genNumber}}</ns2:Line_No>
						<ns2:Entry_No>{{number}}</ns2:Entry_No>
						<ns2:Identifier>{{id}}</ns2:Identifier>
						<ns2:ValueText>{{description}}</ns2:ValueText> <!-- tbd with Rhodius when to be added -->
					</ns2:Quick_Sales_Sub_Doc_Val_WS>
					{{/specialItems}}
					{{#depositItems}}
					<ns2:Quick_Sales_Sub_Doc_Val_WS>
						<ns2:Line_No>{{genNumber}}</ns2:Line_No> <!-- Line No. referring DEPOSITITEM -->
						<ns2:Entry_No>{{number}}</ns2:Entry_No> 
						<ns2:Identifier>DEPOSIT</ns2:Identifier> <!-- fix -->
         				<ns2:DocValKey>DEPOSITITEM</ns2:DocValKey> <!-- DEPOSITITEM (fix) -->
						<ns2:ValueCode>{{id}}</ns2:ValueCode> <!-- referring ITEM No-->
					</ns2:Quick_Sales_Sub_Doc_Val_WS>
					{{/depositItems}}
                    </ns2:DocumentValue>
			</pQuickSalesOrder>
		</CreateQuickSalesOrder>
	</soap:Body>
</soap:Envelope>
